// Даны два числа. Показать большее и меньшее число

int a=778;
int b = 6;

if(a>b) Console.WriteLine($"большее число = {a}, меньшее число = {b}");
else Console.WriteLine($"большее число = {b}, меньшее число = {a}");