//0. Вывести квадрат числа
Console.WriteLine("Введите число");
int num = int.Parse(Console.ReadLine());
Console.WriteLine(num*num);
